chore: remove draw diagrams, keep simple text
